In [83]:
import numpy as np
import pandas as pd

In [84]:
sozluk1={"Isism":["Ahmet","Mehmet","Zeynep","Atil"], "Spor":["Kosu","Yuzme","Kosu","Basketbol"], "Kalori":[100,200,250,150]}
sozluk2={"Isism":["Osman","Levent","Atlas","Fatma"], "Spor":["Kosu","Yuzme","Kosu","Basketbol"], "Kalori":[100,200,250,150]}
sozluk3={"Isism":["Ayse","Mahmut","Duygu","Nur"], "Spor":["Kosu","Yuzme","Badminton","Tenis"], "Kalori":[400,500,100,200]}

In [85]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

concatenation

In [86]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     Isism       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     250
3     Atil  Basketbol     150
4    Osman       Kosu     100
5   Levent      Yuzme     200
6    Atlas       Kosu     250
7    Fatma  Basketbol     150
8     Ayse       Kosu     400
9   Mahmut      Yuzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

In [87]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

     Isism       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yuzme     200
2   Zeynep       Kosu     250
3     Atil  Basketbol     150
4    Osman       Kosu     100
5   Levent      Yuzme     200
6    Atlas       Kosu     250
7    Fatma  Basketbol     150
8     Ayse       Kosu     400
9   Mahmut      Yuzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

merge

In [88]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
              "Spor":["Kosu","Yuzme","Kosu","Basketbol"]}

In [89]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [90]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kosu
1  Mehmet      Yuzme
2  Zeynep       Kosu
3    Atil  Basketbol

In [91]:
mergeSozluk2={"Isim":["Ahmet","Mehmet","Zeynep","Atil"],
              "Spor":[100,200,150,250]}

In [92]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [93]:
mergeDataFrame2

     Isim  Spor
0   Ahmet   100
1  Mehmet   200
2  Zeynep   150
3    Atil   250

In [94]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim     Spor_x  Spor_y
0   Ahmet       Kosu     100
1  Mehmet      Yuzme     200
2  Zeynep       Kosu     150
3    Atil  Basketbol     250

In [95]:
maasSozluk={"Isim" : ["Ahmet","Mehmet","Ali","Osman"],
            "Departman": ["Yazilim","Stais","Pazarlama","Yazilim"],
            "Maas": [200,300,400,500]}

In [96]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [97]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazilim   200
1  Mehmet      Stais   300
2     Ali  Pazarlama   400
3   Osman    Yazilim   500

In [98]:
maasDataFrame["Departman"].unique()

array(['Yazilim', 'Stais', 'Pazarlama'], dtype=object)

In [99]:
maasDataFrame["Departman"].nunique()

3

In [100]:
maasDataFrame["Departman"].value_counts()

Yazilim      2
Stais        1
Pazarlama    1
Name: Departman, dtype: int64

In [101]:
def bruttenNete(maas):
    return maas*0.66

In [102]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [103]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [104]:
yeniBirVeri={"karakter Sinifi": ["South Park","South Park","Simpson","Simpson"],
             "Karakter Ismi":["Cartman","Kenny","Homer","Bart"],
             "Karakter Yas": [9,10,11,12]}

In [105]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [106]:
karakterDF

  karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            11
3         Simpson          Bart            12

In [107]:
karakterDF.pivot_table(values= "Karakter Yas", index=["Karakter Sinifi", "Karakter Ismi"])

KeyError: 'Karakter Sinifi'